
#include <iostream>
#include "matrix.h"
#include "func.h"
/*Класс для работы с матрицами.
 *Поля – размер, одномерный массив.
 *Реализовать методы для произвольного доступа к элементам, добавления и удаления строки или столбца,
транспонирование.
 *возможность автоматического добавления данных,
 *возможность изменить поле объекта(методом), удалить, добавить новый объект в массив или список.
 *классы должны быть разделены на файлы '.h' и '.cpp'
 *Меню должно быть
*/

int main() {
    int func = menu();
    matrix matrix_input;
    std::cout << "Hello, World!" << std::endl;
    return 0;
}
